html/intepreter/amb.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>非确定性计算</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />

<link rel="stylesheet" type="text/css" href="css/main.css" />

</head>
<body>
<div id="content">
<h1 class="title">非确定性计算</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8b5a12d">定义</a>
<ul>
<li><a href="#orgc895f11">思想</a></li>
<li><a href="#org4126b94">与流的比较</a></li>
<li><a href="#org13218fe">amb求值器</a>
<ul>
<li><a href="#org8be9767">amb形式</a></li>
<li><a href="#org408cd50">搜索</a></li>
<li><a href="#org0998fad">驱动循环</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd8688ab">实现</a>
<ul>
<li><a href="#org082cb25">基本设计</a>
<ul>
<li><a href="#org7971c64">续延</a></li>
<li><a href="#orgb820d65">执行过程</a>
<ul>
<li><a href="#orgc924623">回溯</a></li>
</ul>
</li>
<li><a href="#org2d8b388">总结</a></li>
</ul>
</li>
<li><a href="#orgd42cf9a">程序结构</a></li>
<li><a href="#org835ffee">续延过程</a>
<ul>
<li><a href="#orgeedc25b">简单表达式</a></li>
<li><a href="#org8240567">条件表达式</a></li>
<li><a href="#orge0e8ce6">顺序表达式</a></li>
<li><a href="#org5638f2b">定义表达式</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org8b5a12d" class="outline-2">
<h2 id="org8b5a12d">定义</h2>
<div class="outline-text-2" id="text-org8b5a12d">
<p>
<span class="underline">非确定计算</span> 通过向解释器的求值模型中添加 <b>自动搜索</b> 功能来实现。例如： 
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">prime-sum-pair</span> list1 list2<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #696969;">((</span>a <span style="color: #696969;">(</span>an-element-of list1<span style="color: #696969;">))</span>
        <span style="color: #696969;">(</span>b <span style="color: #696969;">(</span>an-element-of list2<span style="color: #696969;">)))</span>
    <span style="color: #696969;">(</span>require <span style="color: #696969;">(</span>prime? <span style="color: #696969;">(</span>+ a b<span style="color: #696969;">)))</span>
    <span style="color: #696969;">(</span>list a b<span style="color: #696969;">)))</span>
</pre>
</div>
</div>

<div id="outline-container-orgc895f11" class="outline-3">
<h3 id="orgc895f11">思想</h3>
<div class="outline-text-3" id="text-orgc895f11">
<ul class="org-ul">
<li>一个表达式可以有多个可能值。如 <span class="underline">an-element-of</span> 可能返回作为其参数的表里的任何元素。求值这种表达式时，求值器自动选出一个值（可能是可以选的任一个值）并维持相关的轨迹：
<ul class="org-ul">
<li>哪些元素选过</li>
<li>哪些没选过</li>
<li>保证不会重选</li>
</ul></li>
<li>如果后面的要求不满足，求值器会在有关的表里 <b>重新选择</b> ，直至求值成功；或者所有选择都已用完时 <b>求值失败</b></li>
</ul>
</div>
</div>

<div id="outline-container-org4126b94" class="outline-3">
<h3 id="org4126b94">与流的比较</h3>
<div class="outline-text-3" id="text-org4126b94">
<ul class="org-ul">
<li>流处理用 <span class="underline">惰性求值</span> 来解耦潜在的流和流元素的实际产生时间之间的紧密联系，使得貌似整个流都存在，元素的产生没有时间顺序</li>
<li>非确定性计算的表达式表示对 <b>一批可能世界的探索</b> ，每个世界由一串选择决定。求值器造成的假相： <b>时间能分叉</b> 。程序保存所有可能的执行历史，计算遇到死路时退回前面选择点转到另一分支</li>
</ul>
</div>
</div>

<div id="outline-container-org13218fe" class="outline-3">
<h3 id="org13218fe">amb求值器</h3>
<div class="outline-text-3" id="text-org13218fe">
<p>
非确定性语言基于一种称为 <b>amb</b> 的特殊形式
</p>

<pre class="example">
这个语言的名字和设计思想来自 John McCarthy。他还提出了＂人工智能＂这个词,被称为＂人工智能之父＂

amb 的名字取自 ambiguous
</pre>

<p>
在定义了前面非确定性过程后，将其送给 <span class="underline">amb</span> 求值器，会看到:
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #5f9ea0; font-style: italic;">;;; </span><span style="color: #5f9ea0; font-style: italic;">Amb-Eval input:</span>
<span style="color: #696969;">(</span>prime-sum-pair '<span style="color: #696969;">(</span>1 3 5 8<span style="color: #696969;">)</span> '<span style="color: #696969;">(</span>20 35 110<span style="color: #696969;">))</span>
<span style="color: #5f9ea0; font-style: italic;">;;; </span><span style="color: #5f9ea0; font-style: italic;">Starting a new problem</span>
<span style="color: #5f9ea0; font-style: italic;">;;; </span><span style="color: #5f9ea0; font-style: italic;">Amb-Eval value:</span>
<span style="color: #696969;">(</span>3 20<span style="color: #696969;">)</span>
</pre>
</div>

<ul class="org-ul">
<li>表达式求值时， <span class="underline">amb求值器</span> 将从两个表里反复选择元素，直至做出一次成功选择</li>
<li>如果需要，还可以要求它做进一步的选择，求出更多可能的值</li>
</ul>
</div>


<div id="outline-container-org8be9767" class="outline-4">
<h4 id="org8be9767">amb形式</h4>
<div class="outline-text-4" id="text-org8be9767">
<p>
我们的求值器中引入一种称为 <span class="underline">amb</span> 的特殊形式：
</p>
<pre class="example">
(amb &lt;e1&gt; &lt;e2&gt; ... &lt;en&gt;)

返回几个参数表达式之一的值
</pre>

<p>
比如：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span>list <span style="color: #696969;">(</span>amb 1 2 3<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>amb 'a 'b<span style="color: #696969;">))</span>
</pre>
</div>

<p>
这个表达式可能返回下面任一结果：
</p>
<pre class="example">
(1 a), (1 b), (2 a), (2 b), (3 a), (3 b)
</pre>

<ul class="org-ul">
<li>如果一个 <span class="underline">amb</span> 表达式只有一个选择，就 <b>确定</b> 地返回该元素的值</li>
<li>无选择的表达式 <span class="underline">(amb)</span> 没有值，其求值导致 <b>计算失败且不产生值</b></li>
</ul>

<pre class="example">
可以认为 (amb) 用来表示 fail
</pre>

<p>
由此可以用 <span class="underline">amb</span> 来表示某个谓词 <span class="underline">p</span> 必须为 <span class="underline">真</span> ：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">require</span> p<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>not p<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>amb<span style="color: #696969;">)))</span>
</pre>
</div>

<p>
结合 <span class="underline">amb</span> 和 <span class="underline">require</span> 可以得到 an-element-of 过程：
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">an-element-of</span> items<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span>require <span style="color: #696969;">(</span>not <span style="color: #696969;">(</span>null? items<span style="color: #696969;">)))</span> <span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">&#34920;&#20026;&#31354;&#26159;&#35745;&#31639;&#22833;&#36133;</span>
  <span style="color: #696969;">(</span>amb <span style="color: #696969;">(</span>car items<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>an-element-of <span style="color: #696969;">(</span>cdr items<span style="color: #696969;">))))</span> <span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">&#21453;&#20043;&#65292;&#36820;&#22238;&#34920;&#20013;&#20219;&#20309;&#19968;&#20010;&#20803;&#32032;</span>
</pre>
</div>

<p>
也可以用来表达 <b>无穷选择</b> ，下面代码返回一个大于或等于给定 <span class="underline">n</span> 的值：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">an-integer-starting-from</span> n<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span>amb n <span style="color: #696969;">(</span>an-integer-starting-from <span style="color: #696969;">(</span>+ n 1<span style="color: #696969;">))))</span>
</pre>
</div>

<pre class="example">
这个过程像是在构造一个流，但 amb 表达式只返回一个整数

而流返回的是一个对象，这个对象表示所有大于或等于 n 的整数的序列 

用户看到 amb 表达式返回一个选择，而流的实现则看到它能逐个地返回所有选择
</pre>
</div>
</div>
<div id="outline-container-org408cd50" class="outline-4">
<h4 id="org408cd50">搜索</h4>
<div class="outline-text-4" id="text-org408cd50">
<p>
<span class="underline">amb</span> 表达式导致计算进程分裂为多个分支：
</p>
<ul class="org-ul">
<li>如果有多个处理器，可把它们分派到不同处理器，同时搜索</li>
<li>只有一个处理器时每次选一个分支，保留其他选择权:
<ul class="org-ul">
<li><b>随机</b> 选择，失败了退回重新选择</li>
<li>按某种 <b>系统化</b> 的方式探查可能的分支。例如 <span class="underline">深度优先</span> : 每次总选第一个尚未检查过的分支，失败时退回最近选择点．探查那里的下一个尚未探查过的分支</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org0998fad" class="outline-4">
<h4 id="org0998fad">驱动循环</h4>
<div class="outline-text-4" id="text-org0998fad">
<p>
<span class="underline">amb</span> 求值器读入表达式，输出 <b>第一个成功</b> 得到的值。允许人工要求回溯：输入 <b>try-again</b> ，求值器将设法找 <b>下一结果</b> ：
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #5f9ea0; font-style: italic;">;;; </span><span style="color: #5f9ea0; font-style: italic;">Amb-Eval input:</span>
<span style="color: #696969;">(</span>prime-sum-pair '<span style="color: #696969;">(</span>1 3 5 8<span style="color: #696969;">)</span> '<span style="color: #696969;">(</span>20 35 110<span style="color: #696969;">))</span>
<span style="color: #5f9ea0; font-style: italic;">;;; </span><span style="color: #5f9ea0; font-style: italic;">Starting a new problem</span>
<span style="color: #5f9ea0; font-style: italic;">;;; </span><span style="color: #5f9ea0; font-style: italic;">Amb-Eval value:</span>
<span style="color: #696969;">(</span>3 20<span style="color: #696969;">)</span>
<span style="color: #5f9ea0; font-style: italic;">;;; </span><span style="color: #5f9ea0; font-style: italic;">Amb-Eval input:</span>
try-again
<span style="color: #5f9ea0; font-style: italic;">;;; </span><span style="color: #5f9ea0; font-style: italic;">Amb-Eval value:</span>
<span style="color: #696969;">(</span>3 110<span style="color: #696969;">)</span>
<span style="color: #5f9ea0; font-style: italic;">;;; </span><span style="color: #5f9ea0; font-style: italic;">Amb-Eval input:</span>
try-again
<span style="color: #5f9ea0; font-style: italic;">;;; </span><span style="color: #5f9ea0; font-style: italic;">Amb-Eval value:</span>
<span style="color: #696969;">(</span>8 35<span style="color: #696969;">)</span>
<span style="color: #5f9ea0; font-style: italic;">;;; </span><span style="color: #5f9ea0; font-style: italic;">Amb-Eval input:</span>
try-again
<span style="color: #5f9ea0; font-style: italic;">;;; </span><span style="color: #5f9ea0; font-style: italic;">There are no more values of</span>
<span style="color: #696969;">(</span>prime-sum-pair <span style="color: #696969;">(</span>quote <span style="color: #696969;">(</span>1 3 5 8<span style="color: #696969;">))</span> <span style="color: #696969;">(</span>quote <span style="color: #696969;">(</span>20 35 110<span style="color: #696969;">)))</span>
<span style="color: #5f9ea0; font-style: italic;">;;; </span><span style="color: #5f9ea0; font-style: italic;">Amb-Eval input:</span>
<span style="color: #696969;">(</span>prime-sum-pair '<span style="color: #696969;">(</span>19 27 30<span style="color: #696969;">)</span> '<span style="color: #696969;">(</span>11 36 58<span style="color: #696969;">))</span>
<span style="color: #5f9ea0; font-style: italic;">;;; </span><span style="color: #5f9ea0; font-style: italic;">Starting a new problem</span>
<span style="color: #5f9ea0; font-style: italic;">;;; </span><span style="color: #5f9ea0; font-style: italic;">Amb-Eval value:</span>
<span style="color: #696969;">(</span>30 11<span style="color: #696969;">)</span>
</pre>
</div>

<p>
遇到 <span class="underline">try-again</span> 之外的其他表达式，都认为是重新开始一个新任务
</p>
</div>
</div>
</div>
</div>
