html/intepreter/amb.html

<div id="outline-container-orgd8688ab" class="outline-2">
<h2 id="orgd8688ab">实现</h2>
<div class="outline-text-2" id="text-orgd8688ab">
<p>
常规的 <span class="underline">Scheme</span> 表达式可能：
</p>
<ul class="org-ul">
<li>求出一个值</li>
<li>不终止</li>
<li>产生错误</li>
</ul>

<p>
<b>非确定性</b> 的 <span class="underline">Scheme</span> 表达式还可能：
</p>
<ul class="org-ul">
<li>走入死胡同</li>
<li>使求值过程 <b>回溯</b></li>
</ul>

<p>
思路：
</p>
<ul class="org-ul">
<li>基于 <b>分析求值器</b> 实现 amb 求值器</li>
<li>不同点就在于它将 <b>生成不同的执行过程</b></li>
</ul>
</div>


<div id="outline-container-org082cb25" class="outline-3">
<h3 id="org082cb25">基本设计</h3>
<div class="outline-text-3" id="text-org082cb25">
</div>
<div id="outline-container-org7971c64" class="outline-4">
<h4 id="org7971c64">续延</h4>
<div class="outline-text-4" id="text-org7971c64">
<p>
<b>续延</b> ( <span class="underline">continuation</span>)是一种 <b>过程参数，将在过程的最后一步调用</b> ： 
</p>
<ul class="org-ul">
<li>具有 <span class="underline">续延</span> 参数的过程不准备返回，最后总调用某个 <span class="underline">续延</span> 过程</li>
<li>有 <span class="underline">尾递归优化</span> 的语言可以处理这种续延参数，能够自动优化运行所需的空间</li>
</ul>

<pre class="example">
如果语言没有尾递归优化，栈空间就会越来越大

例如:

typedef int (*Fun) (int)

int f (..., Fun p) { ...; p(...); return ...; }

从 f 实际返回前都不会释放 f 占用的栈空间
</pre>
</div>
</div>

<div id="outline-container-orgb820d65" class="outline-4">
<h4 id="orgb820d65">执行过程</h4>
<div class="outline-text-4" id="text-orgb820d65">
<p>
在常规 Scheme 语言的分析求值器里， <span class="underline">eval</span> 生成的执行过程要求一个 <span class="underline">环境</span> 参数，而 <span class="underline">amb</span> 分析器产生的执行过程要求三个参数:
</p>
<ol class="org-ol">
<li>一个 <span class="underline">环境</span></li>
<li>一个 <span class="underline">成功续延</span></li>
<li>一个 <span class="underline">失败续延</span></li>
</ol>

<p>
<span class="underline">amb</span> 表达式求值结束时总调用这两个过程之一：
</p>
<ul class="org-ul">
<li>如果求值正常并得到结果，就调用 <b>成功续延</b></li>
<li>如果求值进入死胡同，就调用 <b>失败续延</b></li>
</ul>
</div>

<div id="outline-container-orgc924623" class="outline-5">
<h5 id="orgc924623">回溯</h5>
<div class="outline-text-5" id="text-orgc924623">
<p>
求值过程中的实际 <span class="underline">回溯</span> 是通过 <b>构造适当的成功续延和失败续延</b> 实现的：
</p>
<ul class="org-ul">
<li><span class="underline">成功续延</span> （过程）：将 <b>得到一个值（参数）并将计算进行下去</b> 
<ul class="org-ul">
<li>它还得到一个 <span class="underline">失败续延</span></li>
<li>如果用得到的值做计算将来遇到死胡同，就会调用该 <span class="underline">失败续延</span></li>
</ul></li>
<li><span class="underline">失败续延</span> （过程）的作用是 <b>探查另一个非确定性分支</b> ：
<ul class="org-ul">
<li>在遇到无法确定取哪个值能得到最后结果时先取一个值</li>
<li>同时构造一个失败续延，并将它们一起送给成功续延过程，以便将来遇到失败时回溯</li>
<li>求值无法进行时（如遇到 <span class="underline">require</span> 失败时）：
<ul class="org-ul">
<li>调用当时的失败续延，使执行回到前一选择点去考虑其他分支</li>
<li>如果前一选择点已无更多选择，执行就会回到更前面的选择点（那里保存有以前的失败续延）</li>
</ul></li>
<li><span class="underline">try-again</span> 导致驱动循环直接调用 <b>当时的失败续延</b></li>
<li>如果被选分支做了有副作用的操作（例如 <span class="underline">变量赋值</span> ），后来遇到死胡同回溯时，需要在进入其他选择前 <b>撤销该副作用</b> ：
<ul class="org-ul">
<li>处理方法：让 <span class="underline">产生副作用的操作生成一个能撤销副作用的失败续延过程</span> ，该过程撤销所做修改之后再回溯到前面选择点</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org2d8b388" class="outline-4">
<h4 id="org2d8b388">总结</h4>
<div class="outline-text-4" id="text-org2d8b388">
<pre class="example">
失败续延（过程）的构造，几种情况:
1. amb 表达式：提供一种机制，使当前选择失败时可以换一个选择
2. 最高层驱动循环：在用尽了所有选择的情况下报告失败
3. 赋值：拦截出现的失败并在回溯前消除赋值的效果
</pre>

<pre class="example">
失败的原因是求值遇到死胡同，两种情况下出现：
1. 用户程序执行 (amb) 时
2. 用户输入 try-again 时
</pre>

<pre class="example">
  一个执行过程失败，它就调用自己的失败继续：

  由赋值构造出的失败续延先消除自己的副作用．然后调用该赋值拦截的那个失败续延，将失败进一步回传

  如果某 amb 的失败续延发现所有选择已用完时，就调用这个 amb 早先得到的那个失败续延，把失败传到更早的选择点
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd42cf9a" class="outline-3">
<h3 id="orgd42cf9a">程序结构</h3>
<div class="outline-text-3" id="text-orgd42cf9a">
<p>
<span class="underline">amb</span> 求值器的 <b>语法过程</b> 和 <b>数据结构</b> 表示、基本的 <span class="underline">analyze</span> 过程都与分析求值器一样。只需增加识别 <span class="underline">amb</span> 表达式的语法过程：
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">amb?</span> exp<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>tagged-list? exp 'amb<span style="color: #696969;">))</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(amb? '(amb 1 2 3)) ; =&gt; #t </span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(amb? #t) ; =&gt; #f </span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(amb? 1) ; =&gt; #f</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">amb-choices</span> exp<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>cdr exp<span style="color: #696969;">))</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(amb-choices '(amb 1 2 3)) ; =&gt; (1 2 3)</span>
</pre>
</div>

<p>
在 <span class="underline">analyze</span> 里增加处理 <span class="underline">amb</span> 表达式的分支：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">((</span>amb? exp<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>analyze-amb exp<span style="color: #696969;">))</span>
</pre>
</div>

<p>
最高层的 <span class="underline">ambeval</span> 分析给定的表达式，应用得到的执行过程:
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">ambeval</span> exp env succeed fail<span style="color: #696969;">)</span>
  <span style="color: #696969;">((</span>analyze exp<span style="color: #696969;">)</span> env succeed fail<span style="color: #696969;">))</span> 
</pre>
</div>

<p>
<span class="underline">成功续延</span> 过程都有两个参数：
</p>
<ul class="org-ul">
<li>一个值参数</li>
<li>一个失败续延</li>
</ul>

<p>
<span class="underline">失败续延</span> ：无参过程
</p>

<p>
因此执行过程的形式都是三个参数：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>env succeed fail<span style="color: #696969;">)</span>
  <span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">succeed is (lambda (value fail) ...)</span>
  <span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">fail is (lambda () ...)</span>
  <span style="color: #5f9ea0; font-style: italic;">;;</span><span style="color: #5f9ea0; font-style: italic;">...)</span>
</pre>
</div>

<p>
在最上层的 <span class="underline">ambeval</span> 调用：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span>ambeval <span style="color: #98f5ff;">&lt;exp&gt;</span>
         the-global-environment
         <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>value fail<span style="color: #696969;">)</span> value<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">&#30452;&#25509;&#36820;&#22238; value </span>
         <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">()</span> 'failed<span style="color: #696969;">))</span> <span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">&#36820;&#22238; 'failed</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(define (my-succeed value fail) value) </span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(define (my-fail) 'failed) </span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(my-succeed 1 my-fail) ; =&gt; 1</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(my-fail) ; =&gt; failed</span>
</pre>
</div>

<p>
执行求值 <span class="underline">&lt;exp&gt;</span> ，最后可能返回求出的值(如果得到值),或返回符号 <span class="underline">failed</span> 表示求值失败
</p>
<pre class="example">
  后面实现的驱动循环里用了一个更复杂的续延过程，以便能支持用户输入的 try-again 请求
</pre>
</div>
</div>

<div id="outline-container-org835ffee" class="outline-3">
<h3 id="org835ffee">续延过程</h3>
<div class="outline-text-3" id="text-org835ffee">
<p>
<span class="underline">amb</span> 求值器实现中，最复杂的东西就是 <b>续延过程的构造和传递</b> 
</p>
</div>
