src/intepreter/amb.org
*** 简单表达式
简单表达式的分析和前面一样。这些表达式的 *求值总成功* ，所以都 *调用自己的成功续延* ，但都 *需要传递 fail 续延过程* 

_自求值_ 表达式：
#+BEGIN_SRC scheme
  (define (analyze-self-evaluating exp)
    (lambda (env succeed fail) ;; succeed 过程有 2 个参数，第一个是返回值，第二个是失败续延．而 fail 过程没有参数
      (succeed exp fail))) ;; 直接返回 exp, 把当前的失败续延传递进去

  ;; ((analyze-self-evaluating 1)
  ;;  '()
  ;;  (lambda (value faile) value)
  ;;  (lambda () 'failed)) ; => 1 

  ;; ((analyze-self-evaluating "hello")
  ;;  '()
  ;;  (lambda (value faile) value)
  ;;  (lambda () 'failed)) ; => "hello"
#+END_SRC

_引用_ 表达式：
#+BEGIN_SRC scheme
  (define (analyze-quoted exp)
    (let ((qval (text-of-quotation exp)))
      (lambda (env succeed fail)
	(succeed qval fail))))

  ;; ((analyze-quoted '(quote abc))
  ;;  '()
  ;;  (lambda (value faile) value)
  ;;  (lambda () 'failed)) ; => abc
#+END_SRC

_变量_ 表达式：
#+BEGIN_SRC scheme
  (define (analyze-variable exp)
    (lambda (env succeed fail)
      (succeed (lookup-variable-value exp env)
	       fail)))

  ;; (define test-extend-dev (extend-environment '(a b) '(300 400) '())) ; => test-extend-dev

  ;; ((analyze-variable 'a)
  ;;  test-extend-dev
  ;;  (lambda (value faile) value)
  ;;  (lambda () 'failed))  ; => 300   

  ;; ((analyze-variable 'b)
  ;;  test-extend-dev
  ;;  (lambda (value faile) value)
  ;;  (lambda () 'failed)) ; => 400

  ;; ((analyze-variable 'c)
  ;;  test-extend-dev
  ;;  (lambda (value faile) value)
  ;;  (lambda () 'failed)) ; => ;Unbound variable c
#+END_SRC

#+BEGIN_EXAMPLE
  注意：查找变量的值可能出错，但程序错误并不导致回溯和重新选择
#+END_EXAMPLE

_lambda_ 表达式：
#+BEGIN_SRC scheme
  (define (analyze-lambda exp)
    (let ((vars (lambda-parameters exp))
	  (bproc (analyze-sequence (lambda-body exp))))
      (lambda (env succeed fail)
	(succeed (make-procedure vars bproc env)
		 fail))))

  ;; ((analyze-lambda '(lambda (x) (+ 1 x))) 
  ;;  '()
  ;;  (lambda (value faile) value)
  ;;  (lambda () 'failed)) ; =>  (procedure (x) #[compound-procedure 14] ())
#+END_SRC

*** 条件表达式
#+BEGIN_SRC scheme
  (define (analyze-if exp)
    (let ((pproc (analyze (if-predicate exp)))
	  (cproc (analyze (if-consequent exp)))
	  (aproc (analyze (if-alternative exp))))
      (lambda (env succeed fail)
	(pproc env
	       ;; pproc 过程的成功续延
	       (lambda (pred-value fail2) ;; 如果 pproc 过程执行成功，会把计算出的真假值传递给pred-value
		 (if (true? pred-value)
		     (cproc env succeed fail2)
		     (aproc env succeed fail2)))
	       ;; pproc 过程的失败续延，就是 if 过程的失败续延
	       fail))))
#+END_SRC

生成的执行过程调用由产生的谓词执行过程 _pproc_ : 
+ _pproc_ 的成功续延检查谓词的值，根据其真假调用 _cproc_ 或 _aproc_
+ _pproc_ 执行失败时调用 _if_ 表达式的失败续延过程 _fail_ 

