html/intepreter/amb.html


<div id="outline-container-orgeedc25b" class="outline-4">
<h4 id="orgeedc25b">简单表达式</h4>
<div class="outline-text-4" id="text-orgeedc25b">
<p>
简单表达式的分析和前面一样。这些表达式的 <b>求值总成功</b> ，所以都 <b>调用自己的成功续延</b> ，但都 <b>需要传递 fail 续延过程</b> 
</p>

<p>
<span class="underline">自求值</span> 表达式：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">analyze-self-evaluating</span> exp<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>env succeed fail<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">succeed &#36807;&#31243;&#26377; 2 &#20010;&#21442;&#25968;&#65292;&#31532;&#19968;&#20010;&#26159;&#36820;&#22238;&#20540;&#65292;&#31532;&#20108;&#20010;&#26159;&#22833;&#36133;&#32493;&#24310;&#65294;&#32780; fail &#36807;&#31243;&#27809;&#26377;&#21442;&#25968;</span>
    <span style="color: #696969;">(</span>succeed exp fail<span style="color: #696969;">)))</span> <span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">&#30452;&#25509;&#36820;&#22238; exp, &#25226;&#24403;&#21069;&#30340;&#22833;&#36133;&#32493;&#24310;&#20256;&#36882;&#36827;&#21435;</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">((analyze-self-evaluating 1)</span>
<span style="color: #5f9ea0; font-style: italic;">;;  </span><span style="color: #5f9ea0; font-style: italic;">'()</span>
<span style="color: #5f9ea0; font-style: italic;">;;  </span><span style="color: #5f9ea0; font-style: italic;">(lambda (value faile) value)</span>
<span style="color: #5f9ea0; font-style: italic;">;;  </span><span style="color: #5f9ea0; font-style: italic;">(lambda () 'failed)) ; =&gt; 1 </span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">((analyze-self-evaluating "hello")</span>
<span style="color: #5f9ea0; font-style: italic;">;;  </span><span style="color: #5f9ea0; font-style: italic;">'()</span>
<span style="color: #5f9ea0; font-style: italic;">;;  </span><span style="color: #5f9ea0; font-style: italic;">(lambda (value faile) value)</span>
<span style="color: #5f9ea0; font-style: italic;">;;  </span><span style="color: #5f9ea0; font-style: italic;">(lambda () 'failed)) ; =&gt; "hello"</span>
</pre>
</div>

<p>
<span class="underline">引用</span> 表达式：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">analyze-quoted</span> exp<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #696969;">((</span>qval <span style="color: #696969;">(</span>text-of-quotation exp<span style="color: #696969;">)))</span>
    <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>env succeed fail<span style="color: #696969;">)</span>
      <span style="color: #696969;">(</span>succeed qval fail<span style="color: #696969;">))))</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">((analyze-quoted '(quote abc))</span>
<span style="color: #5f9ea0; font-style: italic;">;;  </span><span style="color: #5f9ea0; font-style: italic;">'()</span>
<span style="color: #5f9ea0; font-style: italic;">;;  </span><span style="color: #5f9ea0; font-style: italic;">(lambda (value faile) value)</span>
<span style="color: #5f9ea0; font-style: italic;">;;  </span><span style="color: #5f9ea0; font-style: italic;">(lambda () 'failed)) ; =&gt; abc</span>
</pre>
</div>

<p>
<span class="underline">变量</span> 表达式：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">analyze-variable</span> exp<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>env succeed fail<span style="color: #696969;">)</span>
    <span style="color: #696969;">(</span>succeed <span style="color: #696969;">(</span>lookup-variable-value exp env<span style="color: #696969;">)</span>
             fail<span style="color: #696969;">)))</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(define test-extend-dev (extend-environment '(a b) '(300 400) '())) ; =&gt; test-extend-dev</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">((analyze-variable 'a)</span>
<span style="color: #5f9ea0; font-style: italic;">;;  </span><span style="color: #5f9ea0; font-style: italic;">test-extend-dev</span>
<span style="color: #5f9ea0; font-style: italic;">;;  </span><span style="color: #5f9ea0; font-style: italic;">(lambda (value faile) value)</span>
<span style="color: #5f9ea0; font-style: italic;">;;  </span><span style="color: #5f9ea0; font-style: italic;">(lambda () 'failed))  ; =&gt; 300   </span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">((analyze-variable 'b)</span>
<span style="color: #5f9ea0; font-style: italic;">;;  </span><span style="color: #5f9ea0; font-style: italic;">test-extend-dev</span>
<span style="color: #5f9ea0; font-style: italic;">;;  </span><span style="color: #5f9ea0; font-style: italic;">(lambda (value faile) value)</span>
<span style="color: #5f9ea0; font-style: italic;">;;  </span><span style="color: #5f9ea0; font-style: italic;">(lambda () 'failed)) ; =&gt; 400</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">((analyze-variable 'c)</span>
<span style="color: #5f9ea0; font-style: italic;">;;  </span><span style="color: #5f9ea0; font-style: italic;">test-extend-dev</span>
<span style="color: #5f9ea0; font-style: italic;">;;  </span><span style="color: #5f9ea0; font-style: italic;">(lambda (value faile) value)</span>
<span style="color: #5f9ea0; font-style: italic;">;;  </span><span style="color: #5f9ea0; font-style: italic;">(lambda () 'failed)) ; =&gt; ;Unbound variable c</span>
</pre>
</div>

<pre class="example">
  注意：查找变量的值可能出错，但程序错误并不导致回溯和重新选择
</pre>

<p>
<span class="underline">lambda</span> 表达式：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">analyze-lambda</span> exp<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #696969;">((</span>vars <span style="color: #696969;">(</span>lambda-parameters exp<span style="color: #696969;">))</span>
        <span style="color: #696969;">(</span>bproc <span style="color: #696969;">(</span>analyze-sequence <span style="color: #696969;">(</span>lambda-body exp<span style="color: #696969;">))))</span>
    <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>env succeed fail<span style="color: #696969;">)</span>
      <span style="color: #696969;">(</span>succeed <span style="color: #696969;">(</span>make-procedure vars bproc env<span style="color: #696969;">)</span>
               fail<span style="color: #696969;">))))</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">((analyze-lambda '(lambda (x) (+ 1 x))) </span>
<span style="color: #5f9ea0; font-style: italic;">;;  </span><span style="color: #5f9ea0; font-style: italic;">'()</span>
<span style="color: #5f9ea0; font-style: italic;">;;  </span><span style="color: #5f9ea0; font-style: italic;">(lambda (value faile) value)</span>
<span style="color: #5f9ea0; font-style: italic;">;;  </span><span style="color: #5f9ea0; font-style: italic;">(lambda () 'failed)) ; =&gt;  (procedure (x) #[compound-procedure 14] ())</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8240567" class="outline-4">
<h4 id="org8240567">条件表达式</h4>
<div class="outline-text-4" id="text-org8240567">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">analyze-if</span> exp<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #696969;">((</span>pproc <span style="color: #696969;">(</span>analyze <span style="color: #696969;">(</span>if-predicate exp<span style="color: #696969;">)))</span>
        <span style="color: #696969;">(</span>cproc <span style="color: #696969;">(</span>analyze <span style="color: #696969;">(</span>if-consequent exp<span style="color: #696969;">)))</span>
        <span style="color: #696969;">(</span>aproc <span style="color: #696969;">(</span>analyze <span style="color: #696969;">(</span>if-alternative exp<span style="color: #696969;">))))</span>
    <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>env succeed fail<span style="color: #696969;">)</span>
      <span style="color: #696969;">(</span>pproc env
             <span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">pproc &#36807;&#31243;&#30340;&#25104;&#21151;&#32493;&#24310;</span>
             <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>pred-value fail2<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">&#22914;&#26524; pproc &#36807;&#31243;&#25191;&#34892;&#25104;&#21151;&#65292;&#20250;&#25226;&#35745;&#31639;&#20986;&#30340;&#30495;&#20551;&#20540;&#20256;&#36882;&#32473;pred-value</span>
               <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>true? pred-value<span style="color: #696969;">)</span>
                   <span style="color: #696969;">(</span>cproc env succeed fail2<span style="color: #696969;">)</span>
                   <span style="color: #696969;">(</span>aproc env succeed fail2<span style="color: #696969;">)))</span>
             <span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">pproc &#36807;&#31243;&#30340;&#22833;&#36133;&#32493;&#24310;&#65292;&#23601;&#26159; if &#36807;&#31243;&#30340;&#22833;&#36133;&#32493;&#24310;</span>
             fail<span style="color: #696969;">))))</span>
</pre>
</div>

<p>
生成的执行过程调用由产生的谓词执行过程 <span class="underline">pproc</span> : 
</p>
<ul class="org-ul">
<li><span class="underline">pproc</span> 的成功续延检查谓词的值，根据其真假调用 <span class="underline">cproc</span> 或 <span class="underline">aproc</span></li>
<li><span class="underline">pproc</span> 执行失败时调用 <span class="underline">if</span> 表达式的失败续延过程 <span class="underline">fail</span></li>
</ul>
</div>
</div>
